测试工具/tsung/conf/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/tsung-1.6.0/share/tsung/tsung-1.0.dtd">
<!-- dumptraffic是調試模式，如果为true，就會打印詳細的請求返回信息，一般設置为false， -->
<tsung loglevel="notice" dumptraffic="false" version="1.0">
<!-- tsung所在的服務器，maxusers就是tsung產生的最大用戶數 -->
  <clients>
    <client host="localhost" use_controller_vm="true"  maxusers="100000" />
  </clients>
<!-- 被測服務器的ip和端口號，type一般設为tcp ->
  <servers>
    <server host="192.168.90.89" port="51003" type="tcp"/>
  </servers>
<!-- tsung產生的壓力 -->
<load>
<!-- phase="1" 第一階段；duration：測試持續時間；unit：單位秒 -->
    <arrivalphase phase="1" duration="300" unit="second">
<!-- maxnumber：最大用戶數；arrivalrate：每秒新增用戶數；unit：單位秒-->
      <users maxnumber="3000" arrivalrate="10" unit="second"/>
    </arrivalphase>
  </load>
<!-- 外部變量 -->
  <options>
<!-- 引入一個外部文件，類型为file_server，變量名为userfile，文件路徑：/tmp/users-->
<!-- 文件是以逗號分隔的csv文件 -->
    <option name="file_server" id="userfile" value=""/>
  </options>
<!-- 會話，每個用戶都按照sessions中的配置發送請求 -->
  <sessions>
<!--probability=“100”:這個session的請求概率是100%，如果要同時測多個api，可以設置請求概率；請求類型为http -->
    <session name="npss" probability="100" type="ts_http">
<!-- 請求次數，to是最大請求數，如果設为100，就是每個用戶請求100次 -->
      <for from="1" to="100" incr="1" var="counter">
<!-- 解析前面引入的外部文件，以逗號做为分隔符，隨機讀取 -->
        <setdynvars sourcetype="file" fileid="userfile" delimiter="," order="random">
          <var name="user_id" />
          <var name="passwd" />
          <var name="auth_token" />
        </setdynvars>
<!-- 返回隨機小數，變量名为decimal，code中可以寫erlang函數 -->
        <setdynvars sourcetype="eval" code="fun({Pid,DynVars}) -> random:uniform() end.">
          <var name="decimal" />
        </setdynvars>
<!-- 返回隨機數，從1到10000 -->
        <setdynvars sourcetype="random_number" start="1" end="10000">
           <var name="int_1_10000" />
        </setdynvars>
<!-- 返回隨機字符串，長度为10 -->
        <setdynvars sourcetype="random_string" length="10">
           <var name="string_10" />
        </setdynvars>
<!-- subst="true"：如果在request中使用變量，需要設置subst -->
        <request subst="true">
<!-- url：被測試的url；method：GET、POST等；contents：POST請求的参數 -->
          <http url="@api" method="@method" contents="@contents" version="1.1">
<!-- http header，可以添加Authorization、Cookie等，注意變量的使用格式：%%_xxx%% -->
            <http_header name="Authorization" value="111"/>
            <http_header name="Cookie" value="authToken=%%_auth_token%%; Path=/"/>
<!-- content-Type：POST請求参數的格式，如果是json格式可以這样寫 -->
            <http_header name="Content-Type" value="application/json"/>
          </http>
        </request>
<!-- thinktime：兩次請求之間的間隔時間，一般小於10s -->
        <thinktime value="1"/>
      </for>
    </session>
  </sessions>
</tsung>